In [1]:
import pandas as pd
import numpy as np

ModuleNotFoundError: No module named 'pandas'

In [3]:
import sys
sys.executable
!python -m pip install pandas numpy

Collecting pandas
  Downloading pandas-2.3.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Collecting numpy
  Downloading numpy-2.4.0-cp313-cp313-win_amd64.whl.metadata (6.6 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp 600\miniconda3\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\hp 600\miniconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp313-cp313-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ------- -------------------------------- 2.1/11.0 MB 10.8 MB/s eta 0:00:01
   ------------- -------------------------- 3.7/11.0 MB 9.6 MB/s eta 0:00:01
   -------------------- ------------------- 5.5/11.0 MB 9.2 MB/s eta 0:00:01
   ------------------------- -------------- 7.1/11.0 MB 8.7 MB/s eta 0:00:01
   ------------------------------- -------- 8.7/11.0 MB 8.6 MB/s eta 0:00:01
   ---------------------------------- ----- 9.4/11.0 MB 7.9 MB/s eta 0:00:01
   ---------------------------------------  10.7/11.0 MB 7.5 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 7.0 MB/s eta 0:00:00
Downloading numpy-2.4.0-cp313-cp313-win_amd64.whl (12.3 MB)
   ---------------------------------------- 0.0/12.3 MB ? eta -:--:--
   ----- ---------------------------------- 1.8/12.3 MB 8.7 MB/s eta 0:00:02
   ------------ --------------------------- 3.9/12.3 MB 9.2 MB/s eta 0:00:01
   ------------------ --------------------- 5.8/12.3 MB 9.0 MB/s eta 0:00:01
   ------------------------- -------------- 7.9/12.3 MB 9.3 MB/s eta 0:00:01
   ------------------------------ --------- 9.4/12.3 MB 8.8 MB/s eta 0:00:01
   ------------------------------------ --- 11.3/12.3 MB 8.8 MB/s eta 0:00:01
   ---------------------------------------  12.1/12.3 MB 8.9 MB/s eta 0:00:01
   ---------------------------------------- 12.3/12.3 MB 8.2 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: pytz, tzdata, numpy, pandas

   ---------------------------------------- 0/4 [pytz]
   ---------------------------------------- 0/4 [pytz]
   ---------------------------------------- 0/4 [pytz]
   ---------- ----------------------------- 1/4 [tzdata]
   ---------- ----------------------------- 1/4 [tzdata]
   ---------- ----------------------------- 1/4 [tzdata]
   ---------- ----------------------------- 1/4 [tzdata]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   -------------------- ------------------- 2/4 [numpy]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ------------------------------ --------- 3/4 [pandas]
   ---------------------------------------- 4/4 [pandas]

Successfully installed numpy-2.4.0 pandas-2.3.3 pytz-2025.2 tzdata-2025.3

In [4]:
import pandas as pd
import numpy as np

In [5]:
data = {
    "nombre": ["Octavio", "Berenice", "Stevie", "Erick", "Kevin"],
    "edad": [35, 23, 48, 23, 22],
    "ingresos": [20000, 15000, 60000, 15000, 15000]
}

df = pd.DataFrame(data)
df

     nombre  edad  ingresos
0   Octavio    35     20000
1  Berenice    23     15000
2    Stevie    48     60000
3     Erick    23     15000
4     Kevin    22     15000

In [6]:
df.head()

     nombre  edad  ingresos
0   Octavio    35     20000
1  Berenice    23     15000
2    Stevie    48     60000
3     Erick    23     15000
4     Kevin    22     15000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   nombre    5 non-null      object
 1   edad      5 non-null      int64
 2   ingresos  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [8]:
df.describe

<bound method NDFrame.describe of      nombre  edad  ingresos
0   Octavio    35     20000
1  Berenice    23     15000
2    Stevie    48     60000
3     Erick    23     15000
4     Kevin    22     15000>

In [9]:
df["edad"]
df[["nombre","ingresos"]]
df[df["ingresos"]> 15000]

    nombre  edad  ingresos
0  Octavio    35     20000
2   Stevie    48     60000

In [10]:
df["ingresos anuales"]=df["ingresos"]*12
df

     nombre  edad  ingresos  ingresos anuales
0   Octavio    35     20000            240000
1  Berenice    23     15000            180000
2    Stevie    48     60000            720000
3     Erick    23     15000            180000
4     Kevin    22     15000            180000

In [14]:
def categoria (x):
    if x>15000:
        return "Alto"
    elif x==15000:
        return "Medio"
    else:
        return "Bajo"
df["Categoria_ingresos"]= df["ingresos"].apply(categoria)
df

     nombre  edad  ingresos  ingresos anuales Categoria_ingresos
0   Octavio    35     20000            240000               Alto
1  Berenice    23     15000            180000              Medio
2    Stevie    48     60000            720000               Alto
3     Erick    23     15000            180000              Medio
4     Kevin    22     15000            180000              Medio

In [15]:
df[df["Categoria_ingresos"]== "Alto"]

    nombre  edad  ingresos  ingresos anuales Categoria_ingresos
0  Octavio    35     20000            240000               Alto
2   Stevie    48     60000            720000               Alto

In [17]:
def solotu (x):
    if x==20000:
        return "Alto"
    else:
        return"Nada"
df["Solo_tu"]=df["ingresos"].apply(solotu)
df

     nombre  edad  ingresos  ingresos anuales Categoria_ingresos Solo_tu
0   Octavio    35     20000            240000               Alto    Alto
1  Berenice    23     15000            180000              Medio    Nada
2    Stevie    48     60000            720000               Alto    Nada
3     Erick    23     15000            180000              Medio    Nada
4     Kevin    22     15000            180000              Medio    Nada

In [18]:
df[df["Solo_tu"]=="Alto"]

    nombre  edad  ingresos  ingresos anuales Categoria_ingresos Solo_tu
0  Octavio    35     20000            240000               Alto    Alto